{
	"Employments": [{
			"company": "SAP SC Ireland",
			"position": "SAP4M£ - Project",
			"date": "June 2021 - Present",
			"keyResponsibilities": [{
					"keyRes": "Developed & maintained all frontend coding through UI5 and Javascript."
				}, {
					"keyRes": "Coded all frontend and backend through IntelliJ IDEA"
				}, {
					"keyRes": "Developments throughout the project included: \n • Integrating SaE and SAM support channels into the SAP4ME platform through UI5 cards. \n • Contribution to the coding of the customer case list application. \n • Corrections of any coding bugs or errors. "
				}, {
					"keyRes": "Designed and developed backend structure and services to backend with use of Sails.js"
				}

			]

		},		
		{
			"company": "SAP SC Ireland",
			"position": "Product Support Travel and Budget Request App - Project",
			"date": "May 2021 - Present",
			"keyResponsibilities": [{
					"keyRes": "Developed & maintained frontend and backend coding through UI5 and Sails.js."
				}, {
					"keyRes": "Coded all frontend and backend through VS code"
				}, {
					"keyRes": "Designed and developed all frontend pages and dialogs"
				}, {
					"keyRes": "Designed and developed backend structure and services to backend with use of Sails.js"
				}

			]

		},
		{
			"company": "SAP SC Ireland",
			"position": "Customer Incident Management Renovation - Fellowship",
			"date": "March 2019 - December 2020",
			"keyResponsibilities": [{
					"keyRes": "Developed & maintained frontend coding through UI5 and JavaScript. All required new developments or corrections requested through SAP JIRA were developed through the SAP Web IDE and pushed to the development environment branch in the CIMR Github repository."
				}, {
					"keyRes": "Created corresponding unit tests for every javaScript function developed."
				}, {
					"keyRes": "Created and maintained analytical reports through SAP Web Analytics. Custom events were coded throughout the project at the request of the project stakeholders. These custom events were then used within SWA to gain valuable insights into customer behavior with the Incident Creation form in the launchpad."
				}, {
					"keyRes": "Developments throughout the project included: \n • Integrating live chat and SaE channels into the incident creation form. \n • Integrating Support Log assistant functionality. \n • Support assistant enhancement features. \n • Simplified Categorization – Expert Areas. \n • Edit incident redesign and code refactoring. \n • SLA server side analysis. \n • Implementation of CNDP for Chinese customers. \n • Promototion of SAP media Channels within the incident creation form."
				}, {
					"keyRes": "Provided A Two day training course to SAP employees on UI5 coding, demonstrating page navigation, models & data binding and development with SAP Web IDE."
				}

			]

		},

		{
			"company": "SAP SC Ireland",
			"position": "Predictive Analytics Integrator - Fellowship",
			"date": "May 2018 - November 2018",
			"keyResponsibilities": [{
					"keyRes": "Developed and maintained CDS views to expose ABAP Public API entities from the Predictive Analytics Repository."
				}, {
					"keyRes": "Developed numerous support programs for the QA team to test the PAi Public API methods."
				}, {
					"keyRes": "Developed the PAi support transaction 'RS_ANA_PAI_PS01'. This transaction allows users any user without access to the FIORI app to view all the details of a predictive scenario. This was done through accessing the PAi API repository methods and displaying the results back to the user through different ALV lists selected from a node tree structure."
				}, {
					"keyRes": "Helped resolve a number of bugs reported through JIRA for PAi"
				}

			]

		},

		{
			"company": "SAP SC Ireland",
			"position": "Machine Manufacturing Analytics - Fellowship",
			"date": "January 2018 - April 2018",
			"keyResponsibilities": [{
				"keyRes": "Develop & maintain frontend and backend coding using SAPUI5, JavaScript and SQLScript. Any required changes or upgrades to core coding were done through the use of eclipse development environment while versioning was controlled with the use of GIT, MAVEN and Jenkins"
			}, {
				"keyRes": "Developed the entire shell and UI for the MMA-LITE functionality. This was a concept functionality to provide a cloud version of the MMA program."
			}, {
				"keyRes": "Take part and contribute in agile development (Scrum) meetings. Daily meetings to discuss work completed and what work would be accomplished during the day as part of the scrum methodology."
			}, {
				"keyRes": "As part of the scrum methodology, work was completed within time periods of 3 week sprints. Each sprint would be planned and discussed to estimate time needed for each piece of requested functionality. At the end of each sprint all work would be reviewed to determine what worked well during the sprint and also what did not work well to continuously improve knowledge and processes."
			}, {
				"keyRes": "Fix any reported bugs in frontend and backend coding reported by the QA team. Any fixes / code changes were tested while liaising with the QA team to ensure expected system behavior."
			}, {
				"keyRes": "Created Unit tests for any new stored procedures created for the backend through SQLscript. These were created with the use of the web IDE to bypass complete builds of the program to speed up development."
			}]

		}, {
			"company": "SAP SC Ireland",
			"position": "Senior Support Consultant / MM-IV Nexus",
			"date": "2005 - Present",
			"keyResponsibilities": [{
					"keyRes": "Analyse and resolve customer incidents by means of knowledge databases (SAP Notes, solved customer incidents, documentation) and/or verifying customised entries or hardware parameters"
				}, {
					"keyRes": "Analysis and configuration of customer systems through remote access and debugging the coding. Recommendations are then made to development for any corrections to be made."
				}, {
					"keyRes": "Maintain and present training material to colleagues in various GSCs globally. This also involves creating test data within internal systems and providing exercises for colleagues to improve their knowledge of the MM-IV area."
				}, {
					"keyRes": "Creation of knowledge based articles and WIKIs for customers to reuse information gained from previous issues."
				}, {
					"keyRes": "Support of Fiori apps in the materials management component area through providing resolutions in customer incidents and documentation of resolutions through knowledge based articles."
				}, {
					"keyRes": "Participation in Success Factors surge 2500 project. This involved helping reduce the number of customer incidents in the Success Factors area of provisioning including issues involving single sign on, file hosting and role based permissions."
				}, {
					"keyRes": "Participation in the Indian specific component area during new goods & services tax implementations."
				}, {
					"keyRes": "Helping colleagues on more complex customer issues as MM-IV Nexus. This also involves remote calls with colleagues and discussing customer incidents to improve their knowledge of the MM-IV area."
				}, {
					"keyRes": "Providing resolutions to critical customer issues as MM-IV nexus. For very high priority incidents or max attention customers, a high level of MM-IV knowledge is required. Remote sessions with customers and guiding them to resolution is provided through phone calls and screen sharing."
				}, {
					"keyRes": "Design & development of Invoice Posting Logic supportability tool with ABAP coding. This also involves constant testing and developing improvements of the program on customer systems."
				}, {
					"keyRes": "Consult with development colleagues on trainings and supportability tool coding."
				}

			]
		}

	]
}
